rails-rest/app/controllers/api/v1/contacts_controller.rb

SELECT `contacts`.* FROM `contacts` ORDER BY created_at DESC
---
      def index
        contacts = Contact.order('created_at DESC');

SELECT  `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 68 LIMIT 1
---
      def show
        contact = Contact.find(params[:id])

INSERT INTO `contacts` (`fullname`, `phone`, `created_at`, `updated_at`) VALUES ('Arjun Ghimire', '9840122530', '2018-06-27 06:08:44', '2018-06-27 06:08:44')
---
      def create
        contact = Contact.new(contact_params)

        if contact.save

SELECT  `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 2 LIMIT 1
DELETE FROM `contacts` WHERE `contacts`.`id` = 2
---
      def destroy
        contact = Contact.find(params[:id])
        Contact.destroy

SELECT  `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 3 LIMIT 1
UPDATE `contacts` SET `fullname` = 'Subhash Bista', `phone` = '8929348239', `updated_at` = '2018-06-27 10:42:48' WHERE `contacts`.`id` = 4
---
      def update
        contact = Contact.find(params[:id])
        if Contact.update_attributes(contact_params)